app/controllers/careers_controller.rb

SELECT  "careers".* FROM "careers" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @careers = Career.paginate(:page => params[:page], :per_page => 5)