app/controllers/publications_controller.rb

  def index
    @publications = Publication.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "publications".* FROM "publications" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

    def set_publication
      @publication = Publication.find(params[:id])
---
SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]